<template>
	<view class="grandpa">
		<p>
				在你注册本网站帐户，使用其他本网站产品或服务，访问本网站网页,
			或参加促销和有奖游戏时，本网站会收集你的个人身份识别资料。本网站
			也会收集来自商业伙伴的身份识别资料。
		</p>
		<p>
				当你注册本网站帐户时,本网站会问及你的个人信息。只要你在本网
			站成功注册并登录服务器，本网站将可以识别你。
		</p>
		<p>	
				本网站会自动接收并记录你的浏览器和服务器日志上的信息，其中包
			括你的 IP 地址,本网站 cookie 中的信息以及你需求的网页记录。
		</p>
		<p>
				本网站会将这些资料用于：改进为你提供的广告及网页内容，满足你
			对某种产品的需求或通知你最新产品信息。
		</p>
	</view>
</template>

<script>
</script>

<style lang="scss">
	.grandpa{
		margin: 0.5rem;
		p{
			text-indent:2em;/*首行缩进两个单位*/  
			line-height:1.5em;/*行距为1.5个单位*/  
		}
	}
</style>
